{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": {"keras_version": "2.4.0", 
"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "generator", "layers": [{"class_name": "InputLayer", "config": 
{"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "G_Latent_Input"}, "name": "G_Latent_Input", "inbound_nodes": 
[]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "ragged": false, "name": "G_Temp_Input"}, 
"name": "G_Temp_Input", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "G_Concatenate", "trainable": true, "dtype": "float32", "axis": 
-1}, "name": "G_Concatenate", "inbound_nodes": [[["G_Latent_Input", 0, 0, {}], ["G_Temp_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": 
"G_Dense_1", "trainable": true, "batch_input_shape": [null, 256], "dtype": "float32", "units": 12544, "activation": "linear", "use_bias": false, 
"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, 
"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "G_Dense_1", 
"inbound_nodes": [[["G_Concatenate", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "G_BM_1", "trainable": true, "dtype": "float32", 
"axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": 
{"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", 
"config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "G_BM_1", "inbound_nodes": 
[[["G_Dense_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "G_LReLU_1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, 
"name": "G_LReLU_1", "inbound_nodes": [[["G_BM_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "G_Reshape", "trainable": true, "dtype": 
"float32", "target_shape": [7, 7, 256]}, "name": "G_Reshape", "inbound_nodes": [[["G_LReLU_1", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": 
{"name": "G_Conv2DTranspose_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", 
"data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": 
"GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, 
"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "G_Conv2DTranspose_1", "inbound_nodes": 
[[["G_Reshape", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "G_BM_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 
0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", 
"config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, 
"beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "G_BM_2", "inbound_nodes": 
[[["G_Conv2DTranspose_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "G_LReLU_2", "trainable": true, "dtype": "float32", "alpha": 
0.30000001192092896}, "name": "G_LReLU_2", "inbound_nodes": [[["G_BM_2", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": 
"G_Conv2DTranspose_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": 
"channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", 
"config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, 
"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "G_Conv2DTranspose_2", "inbound_nodes": 
[[["G_LReLU_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "G_BM_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 
0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", 
"config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, 
"beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "G_BM_3", "inbound_nodes": 
[[["G_Conv2DTranspose_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "G_LReLU_3", "trainable": true, "dtype": "float32", "alpha": 
0.30000001192092896}, "name": "G_LReLU_3", "inbound_nodes": [[["G_BM_3", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": 
"G_Final_Conv2DTranspose", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": 
"channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": 
{"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, 
"kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "G_Final_Conv2DTranspose", "inbound_nodes": [[["G_LReLU_3", 0, 0, {}]]]}], 
"input_layers": [["G_Temp_Input", 0, 0], ["G_Latent_Input", 0, 0]], "output_layers": [["G_Final_Conv2DTranspose", 0, 0]]}}}, "weightsManifest": [{"paths": 
["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "G_BM_1/gamma", "shape": [12544], "dtype": "float32"}, {"name": 
"G_BM_1/beta", "shape": [12544], "dtype": "float32"}, {"name": "G_BM_1/moving_mean", "shape": [12544], "dtype": "float32"}, {"name": "G_BM_1/moving_variance", 
"shape": [12544], "dtype": "float32"}, {"name": "G_BM_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "G_BM_2/beta", "shape": [128], "dtype": 
"float32"}, {"name": "G_BM_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "G_BM_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": 
"G_BM_3/gamma", "shape": [64], "dtype": "float32"}, {"name": "G_BM_3/beta", "shape": [64], "dtype": "float32"}, {"name": "G_BM_3/moving_mean", "shape": [64], 
"dtype": "float32"}, {"name": "G_BM_3/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "G_Conv2DTranspose_1/kernel", "shape": [4, 4, 128, 256], 
"dtype": "float32"}, {"name": "G_Conv2DTranspose_2/kernel", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "G_Dense_1/kernel", "shape": [138, 12544], 
"dtype": "float32"}, {"name": "G_Final_Conv2DTranspose/kernel", "shape": [7, 7, 1, 64], "dtype": "float32"}]}]}
